results/golang/chi_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.41ms    9.09ms 258.34ms   96.36%
    Req/Sec     5.84k     1.50k    8.54k    73.37%
  688243 requests in 30.09s, 80.08MB read
Requests/sec:  22872.52
Transfer/sec:      2.66MB