results/golang/fiber_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.75ms    6.52ms 199.27ms   96.54%
    Req/Sec     6.18k     1.51k    8.85k    71.81%
  733841 requests in 30.09s, 84.68MB read
Requests/sec:  24391.80
Transfer/sec:      2.81MB