results/golang/kratos_results.txt
Running 30s test @ http://localhost:8000/compute
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.30ms   10.72ms 203.56ms   96.05%
    Req/Sec     5.20k     1.53k    8.23k    76.68%
  619043 requests in 32.47s, 77.34MB read
  Socket errors: connect 0, read 0, write 0, timeout 100
Requests/sec:  19064.61
Transfer/sec:      2.38MB